[FileInfo]
TranslatorName=Zipfolder && D.Yerokhin
LanguageName=Русский
TargetVersion=0.4.13.*
[General]
1001=Выделение
1002=Кисть
1003=Ластик
1004=Штамп
1005=Заменитель цвета
1006=Текст
1007=Линия
1008=Линия-стрелка
1009=Эллипс
1010=Прямоугольник
1011=Заливка
1012=Выбор цвета
1013=Поворот изображения
1014=Измерение
1015=Настойки ручки и кисти
1016=Включить поясняющие контекстные подсказки
1017=О программе...
2001=Инструмент выделения (как в IrfanView).\nНапример, можно выделять области на изображении.
2002=Кисть: используется для рисования.\nНажав левую кнопку мыши, рисуйте основным цветом,\nа нажав правую - дополнительным.
2003=Ластик: используется для удаления чего-либо.\nПеремещайте мышь с нажатой левой кнопкой для удаления с заменой дополнительным цветом,\nа с нажатой правой - для удаления с восстанавлением исходного изображения.
2004=Штамп: копирует выбранную область рисунка в другую часть изображения.\nМожет использоваться для удаления пыли и царапин с фотографий.\nПравым щелчком выделяете 'донорскую' область, левым выбираете, куда вы хотите вставить фрагмент.
2005=Инструмент для замены одного цвета другим.\nПеремещайте мышь с нажатой левой кнопкой для замены дополнительного цвета основным,\nа нажав правую - для замены основного дополнительным.
2006=Инструмент для нанесения текста на изображение.\nПерекрестие курсора будет базовой линией текста.\nТекст может выравниваться влево, вправо или по центру относительно точки вставки.
2007=Инструмент для рисования прямых линий.\nЧтобы начать рисование линии, нажмите левую кнопку мыши и перемещайте мышь. Чтобы завершить рисование, отпустите кнопку.\nЧтобы прервать рисование, нажмите правую кнопку мыши.\nУдерживайте CTRL при перемещении, чтобы курсор стал центром линии.\nУдерживайте SHIFT для рисования линий под углами, кратными 45°.
2008=Инструмент для рисования стрелок.\nЧтобы начать рисование стрелки, нажмите левую кнопку мыши и перемещайте мышь. Чтобы завершить рисование, отпустите кнопку.\nЧтобы прервать рисование, нажмите правую кнопку мыши.\nУдерживайте CTRL при перемещении, чтобы курсор стал центром стрелки.\nУдерживайте SHIFT для рисования стрелок под углами, кратными 45°.\nПравый щелчок по этой кнопке - меню настроек.
2009=Инструмент для рисования кругов и эллипсов.\nЕсли включена опция 'Залить', они будут заполненными, если нет, то пустыми.\nЧтобы начать рисование, перемещайте мышь, нажав её правую кнопку. Чтобы завершить рисование, отпустите кнопку.\nЧтобы прервать рисование, нажмите правую кнопку мыши.\nУдерживайте CTRL, чтобы курсор стал центром эллипса.\nУдерживайте SHIFT, если хотите нарисовать круг.
2010=Инструмент для рисования прямоугольников и квадратов.\nЕсли включена опция 'Залить', они будут заполненными, если нет, то пустыми.\nЧтобы начать рисование, перемещайте мышь, нажав её правую кнопку. Чтобы завершить рисование, отпустите кнопку.\nЧтобы прервать рисование, нажмите правую кнопку мыши.\nУдерживайте CTRL, чтобы курсор стал центром прямоугольника.\nУдерживайте SHIFT, если хотите нарисовать квадрат.
2011=Инструмент для заливки выделенной области одним цветом.\nЩелчок левой кнопкой мыши - заполнение области основным цветом,\nщелчок правой - дополнительным.
2012=Инструмент для выбора цвета из изображения.\nЩёлкните по цвету левой кнопкой мыши, чтобы сделать его основным,\nили правой, чтобы он стал дополнительным.\nЩёлкните по этой кнопке, нажав SHIFT, чтобы отменить автовозврат к предыдущему инструменту после выбора цвета.
2013=Инструмент для поворота/выравнивания изображений.\nНажмите левую кнопку мыши и переместите мышь, чтобы 'подчеркнуть' область, которая должна стать горизонтальной или вертикальной.\nЧтобы прервать операцию, нажмите правую кнопку мыши.\nУдерживайте CTRL при перемещении, чтобы курсор стал центром линии.\nУдерживайте SHIFT, чтобы провести линию под углом, кратным 45°.
2014=Этот инструмент позволяет измерять расстояния и углы на изображении.\nНажмите правую кнопку мыши на исходной точке, переместите мышь в интересующую точку и отпустите кнопку.\nВсе углы отсчитываются относительно горизонтальной линии.\nЧтобы прервать линию, щёлкните правой кнопкой мыши.\nУдерживайте CTRL при перетаскивании, чтобы центрировать линию относительно исходной точки.\nУдерживайте SHIFT при перетаскивании, чтобы углы были кратны 45°.\nЩёлкните правой кнопкой мыши по этой кнопке, чтобы открыть окно создания единиц измерения и правки, удаления, сортировки имеющихся.
2015=Открыть окно настроек ручки и кисти
2016=Поясняющие контекстные подсказки
2017=Показать сведения о версии IrfanPaint и благодарности
5000=Ошибка
5201=Сначала выберите 'донорскую' область (щёлкните по ней правой кнопкой мыши).\nПодробности о работе с инструментом 'Штамп' см. в контекстной справке.
5102=Невозможно сохранить установки. Проверьте, доступен ли для записи файл i_view32.ini.
6001=Особые благодарности: \r\n\r\nIrfan Skiljan (автору IrfanView)\r\n\r\nУчастникам форума поддержки IrfanView, в частности:\r\nBhikkhu Pesala,\r\nMatera,\r\nSteve.\r\n\r\nБета-тестерам, в особенности Leon Fisk,\r\n\r\nDavide Pizzolato за его библиотеку CxImage (http://www.codeproject.com/KB/graphics/cximage.aspx),\r\n\r\nLode Vandevenne за его алгоритм заполнения (http://student.kuleuven.be/~m0216922/CG/floodfill.html),\r\n\r\nCodeProject.com за полезные статьи.\r\n\r\nВсем переводчикам,\r\n\r\nа также пользователям, сделавшим пожертвования. Спасибо вам!
1443=&Основной цвет
1444=&Дополнительный цвет
5301=Неправильный номер.
1101=%language% перевод: %translator%
[101]
0=О модуле IrfanPaint
1=OK
1102=Текст
1104=&Сайт IrfanPaint
[100]
0=Paint
1060=Панель инструментов
1053=Толщина (в пикселах)
1059=Залить
1056=Допуск:
[103]
0=Настройки стрелок
1=OK
2=Отмена
1301=&<----
1311=Рисовать:
1302=&---->
1309=Толщина стрелки:
1310=Длина стрелки:
1308=Простая
[102]
0=Выбор цвета
1=OK
2=Отмена
[104]
0=Настройки ручки и кисти
1442=Ручка
1441=Кисть
1=OK
2=Отмена
1432=Стиль:
1404=_______
1405=_ _ _ _ _
1406=. . . . . .
1407=_ . _ . _ .
1408=_ . . _ . .
1433=Точка:
1410=Круг
1411=Квадрат
1412=Плоско
1434=Края:
1413=Круглые
1414=Прямые
1415=Острые
1416=Непрерывные
1417=- (горизонт.)
1418=|| (вертик.)
1419=\\\\ (вниз)
1420=// (вверх)
1421=+ (крестиком)
1422=x (диагонали)
1435=Стрелки
1437=45° слева направо
1438=Пересечение
1436=С полосками
1439=Цвет полосок
1445=Толщина ручки
1448=пикс. (1-9999)
1440=Цвет стрелок
1426=Прозрачный
1429=" " = 1 пробел\r\n"." = 1 точка
1431=Щёлкните по этому полю для смены основного стиля и фона.
[105]
0=Вставить текст
1501=&Шрифт:
1502=&Размер:
1506=&Жирный
1507=&Курсив
1508=&Подчёркнутый
1509=&Зачёркнутый
1510=По &левому краю
1511=По &центру
1512=По пр&авому краю
1=OK
2=Отмена
1526=Нажмите для &предпросмотра...
1513=Выбрать &цвет...
1521=Метод обсчёта
1522=Пустой путь
1524=Текст
1523=Заполненный путь
1525=Сглаживание
